99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_ap.c
/* cutils defines branch hints; IDF guards its own definitions when included later. */
#include "esp32_mquickjs_memory.h"
#include "cutils.h"
#include "esp32_mquickjs_wifi_action_radio.h"
#include "esp32_mquickjs_wifi_raw_tx_ap.h"
#include "esp32_mquickjs_wifi.h"
#include "esp32_mquickjs_wifi_wait.h"
#include "esp32_mquickjs_wifi_wps_ap_radio.h"
#include "esp32_mquickjs_wifi_eap_radio.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_net.h"
#include "esp32_mquickjs_wifi_netif.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp_wifi_default.h"
#include "esp_mac.h"
#include <math.h>
#include <stdio.h>
#include <string.h>

/* No callback or JS pointer is retained here. startAP uses exclusive startup;
 * configure can share with Station. Default netif handlers own DHCP/IP readiness. */
static esp_netif_t *s_ap_netif;
static esp32_mquickjs_wifi_radio_lease_t s_ap_lease;
static esp32_mquickjs_wifi_radio_lifecycle_t s_ap_lifecycle;
/* Borrowed identity only: the Station/configuration coordinator owns this
 * reservation. Keep it across failed native retirement and runtime teardown. */
static esp32_mquickjs_wifi_radio_lifecycle_t s_ap_coordinator;
/* Identity-only observer of a Session-owned lease; no release authority. */
static struct { uint32_t generation, identity; } s_ap_raw_owner;
static bool s_ap_cleanup_pending;
static bool s_ap_partial_stop;
static const char *s_ap_stage;
static esp_err_t s_ap_detach_error;

esp_err_t esp32_mquickjs_wifi_ap_netif_cleanup_error(void) { return s_ap_detach_error; }

const esp32_mquickjs_wifi_radio_lease_t *esp32_mquickjs_wifi_ap_control_lease(void)
{
    return s_ap_lease.acquired && !s_ap_cleanup_pending ? &s_ap_lease : NULL;
}

static esp_err_t wifi_ap_prepare_netif(void)
{
    if (s_ap_netif != NULL || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    s_ap_stage = "net-init";
    esp_err_t err = esp32_mquickjs_net_ensure_initialized();
    if (err != ESP_OK) return err;
    s_ap_stage = "netif-create";
    esp_netif_config_t config = ESP_NETIF_DEFAULT_WIFI_AP();
    s_ap_netif = esp_netif_new(&config);
    if (s_ap_netif == NULL) return ESP_ERR_NO_MEM;
    s_ap_stage = "netif-attach";
    err = esp_netif_attach_wifi_ap(s_ap_netif);
    if (err != ESP_OK) return err;
    s_ap_stage = "netif-handlers";
    return esp_wifi_set_default_wifi_ap_handlers();
}

static esp_err_t wifi_ap_retire_netif(void)
{
    if (s_ap_detach_error != ESP_OK) return s_ap_detach_error;
    if (s_ap_netif == NULL) return ESP_OK;
    s_ap_stage = "netif-detach";
    return esp32_mquickjs_wifi_netif_retire(&s_ap_netif, &s_ap_detach_error);
}

esp_err_t esp32_mquickjs_wifi_ap_open_raw_tx_rate(
    esp32_mquickjs_wifi_raw_tx_ap_context_t *context, const wifi_tx_rate_config_t *rate,
    uint8_t channel, esp32_mquickjs_wifi_radio_lease_t *lease, uint8_t *actual_channel,
    const char **stage)
{
    if (stage == NULL) return ESP_ERR_INVALID_ARG;
    *stage = "ap-rate-admission";
    if (context == NULL || context->owned || context->lifecycle.identity != 0U ||
        context->lifecycle.generation != 0U || context->mode != 0U || context->station_cleanup_pending ||
        lease == NULL || lease->acquired ||
        lease->identity != 0U || lease->generation != 0U || actual_channel == NULL ||
        !esp32_mquickjs_wifi_tx_rate_valid(rate)) return ESP_ERR_INVALID_ARG;
    if (!esp32_mquickjs_wifi_raw_tx_ap_ready() || s_ap_netif != NULL || s_ap_lease.acquired ||
        s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    *stage = "ap-rate-config-allocate";
    wifi_config_t *saved = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*saved), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (saved == NULL) return ESP_ERR_NO_MEM;
    *stage = "ap-rate-admission";
    wifi_mode_t mode;
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_raw_tx_ap_rate(rate, &context->lifecycle, &mode);
    if (err != ESP_OK) goto done;
    context->owned = true;
    context->mode = (uint8_t)mode;
    s_ap_coordinator = context->lifecycle;
    s_ap_cleanup_pending = true;
    *stage = "ap-rate-config";
    err = esp32_mquickjs_wifi_radio_copy_stopped_ap_configuration(&context->lifecycle, saved);
    if (err != ESP_OK) goto done;
    /* No implicit AP channel rewrite or post-start CSA for a fixed request. */
    if (channel != 0U && channel != saved->ap.channel) { err = ESP_ERR_INVALID_ARG; goto done; }
    *stage = "ap-rate-station-retire";
    context->station_cleanup_pending = true;
    err = esp32_mquickjs_wifi_retire_for_configuration(&context->lifecycle);
    if (err != ESP_OK) goto done;
    context->station_cleanup_pending = false;
    if (mode & WIFI_MODE_STA) {
        *stage = "ap-rate-station-prepare";
        context->station_cleanup_pending = true;
        err = esp32_mquickjs_wifi_prepare_for_configuration(&context->lifecycle);
        if (err != ESP_OK) goto done;
    }
    *stage = "ap-rate-helper-prepare";
    err = esp32_mquickjs_wifi_radio_check_stopped_lifecycle(&context->lifecycle, false);
    if (err == ESP_OK) err = wifi_ap_prepare_netif();
    if (err != ESP_OK) goto done;
    *stage = "ap-rate-start";
    err = esp32_mquickjs_wifi_radio_start_raw_tx_ap_rate(&context->lifecycle, mode, saved, rate, lease, actual_channel);
    s_ap_coordinator = context->lifecycle;
    if (lease->acquired) {
        s_ap_raw_owner.generation = lease->generation;
        s_ap_raw_owner.identity = lease->identity;
    }
    if (err == ESP_OK) { s_ap_cleanup_pending = false; s_ap_stage = NULL; *stage = NULL; }
done:
    if (context->owned && err != ESP_OK) s_ap_stage = *stage;
    esp32_mquickjs_wireless_secure_zero(saved, sizeof(*saved));
    esp32_mquickjs_memory_payload_free(saved);
    return err;
}

esp_err_t esp32_mquickjs_wifi_ap_close_raw_tx_rate(
    esp32_mquickjs_wifi_raw_tx_ap_context_t *context, esp32_mquickjs_wifi_radio_lease_t *lease,
    bool physically_terminated, const char **stage)
{
    if (context == NULL || lease == NULL || stage == NULL) return ESP_ERR_INVALID_ARG;
    *stage = "ap-rate-cleanup-admission";
    if (!context->owned) return ESP_OK;
    if (physically_terminated) {
        /* The admitted central recovery already retired this AP helper before
         * deinit. Never touch a new helper it may have subsequently rebuilt. */
        if (lease->acquired || context->lifecycle.identity != 0U || s_ap_raw_owner.identity != 0U)
            return ESP_ERR_INVALID_STATE;
        memset(context, 0, sizeof(*context));
        *stage = NULL;
        return ESP_OK;
    }
    if (context->lifecycle.identity != 0U) {
        if (s_ap_coordinator.identity != context->lifecycle.identity ||
            s_ap_coordinator.generation != context->lifecycle.generation) return ESP_ERR_INVALID_STATE;
    } else if (!lease->acquired || s_ap_raw_owner.identity != lease->identity ||
               s_ap_raw_owner.generation != lease->generation || s_ap_coordinator.identity != 0U)
        return ESP_ERR_INVALID_STATE;
    s_ap_cleanup_pending = true;
    *stage = s_ap_stage = "ap-rate-stop-restore";
    esp_err_t err = esp32_mquickjs_wifi_radio_quiesce_raw_tx_ap_rate(lease, &context->lifecycle);
    if (context->lifecycle.identity != 0U) s_ap_coordinator = context->lifecycle;
    if (err != ESP_OK) return err;
    *stage = s_ap_stage = "ap-rate-helper-retire";
    err = esp32_mquickjs_wifi_radio_check_stopped_lifecycle(&context->lifecycle, true);
    if (err == ESP_OK) err = wifi_ap_retire_netif();
    if (err != ESP_OK) return err;
    if (context->station_cleanup_pending) {
        *stage = s_ap_stage = "ap-rate-station-retire";
        err = esp32_mquickjs_wifi_retire_for_configuration(&context->lifecycle);
        if (err != ESP_OK) return err;
        context->station_cleanup_pending = false;
    }
    *stage = s_ap_stage = "ap-rate-finish";
    err = esp32_mquickjs_wifi_radio_finish_lifecycle(&context->lifecycle, false);
    if (err != ESP_OK) return err;
    memset(&s_ap_raw_owner, 0, sizeof(s_ap_raw_owner));
    memset(&s_ap_coordinator, 0, sizeof(s_ap_coordinator));
    memset(context, 0, sizeof(*context));
    s_ap_cleanup_pending = false;
    s_ap_stage = *stage = NULL;
    return ESP_OK;
}

/* Runtime task only: the borrowed token excludes driver mutation through
 * allocation/handler setup and native AP_START. No JS is retained or polled. */
esp_err_t esp32_mquickjs_wifi_ap_reopen(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station, wifi_config_t *config,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_ap_netif != NULL || s_ap_lease.acquired || s_ap_cleanup_pending ||
        s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U || s_ap_detach_error != ESP_OK)
        return ESP_ERR_INVALID_STATE;
    s_ap_stage = "ap-reopen-admission";
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_ap_reopen(application, station, config, &s_ap_lease, token);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    err = esp32_mquickjs_wifi_radio_check_ap_reopen(token);
    if (err == ESP_OK) err = wifi_ap_prepare_netif();
    if (err == ESP_OK) {
        s_ap_stage = "ap-reopen-start";
        err = esp32_mquickjs_wifi_radio_finish_ap_reopen(token, &config->ap.channel);
    }
    if (err == ESP_OK) {
        memset(&s_ap_coordinator, 0, sizeof(s_ap_coordinator));
        s_ap_cleanup_pending = false;
        s_ap_stage = NULL;
        return ESP_OK;
    }
    /* Keep netif and lease on failure. stopAP can retire a never-started AP
     * immediately; an attempted native start must pass AP_STOP first. */
    esp_err_t abort_error = esp32_mquickjs_wifi_radio_abort_ap_reopen(token);
    if (abort_error != ESP_OK) return abort_error;
    s_ap_partial_stop = true;
    return err;
}

static bool wifi_ap_partial_token(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    return token != NULL && token->identity != 0U && s_ap_partial_stop &&
        s_ap_coordinator.identity == token->identity && s_ap_coordinator.generation == token->generation;
}

esp_err_t esp32_mquickjs_wifi_ap_begin_partial_stop(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_ap_netif == NULL || !s_ap_lease.acquired || s_ap_cleanup_pending ||
        s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U || s_ap_detach_error != ESP_OK)
        return ESP_ERR_INVALID_STATE;
    s_ap_stage = "admission";
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_ap_stop(application, station, &s_ap_lease, token);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_partial_stop = true;
    s_ap_stage = "ap-stop";
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_ap_retire_partial_stop(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_ap_partial_token(token)) return ESP_ERR_INVALID_STATE;
    s_ap_stage = "ap-stop";
    esp_err_t err = esp32_mquickjs_wifi_radio_check_ap_stopped_lifecycle(token);
    if (err != ESP_OK) return err;
    return wifi_ap_retire_netif();
}

esp_err_t esp32_mquickjs_wifi_ap_finish_partial_stop(esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_ap_partial_token(token) || s_ap_netif != NULL || s_ap_detach_error != ESP_OK)
        return ESP_ERR_INVALID_STATE;
    s_ap_stage = "ap-stop-finish";
    esp_err_t err = esp32_mquickjs_wifi_radio_finish_ap_stop(token, &s_ap_lease);
    if (err != ESP_OK) return err;
    memset(&s_ap_coordinator, 0, sizeof(s_ap_coordinator));
    s_ap_partial_stop = false;
    s_ap_cleanup_pending = false;
    s_ap_stage = NULL;
    return ESP_OK;
}

