99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_ap.c
esp_err_t esp32_mquickjs_wifi_ap_adopt_partial_stop(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!wifi_ap_partial_token(token)) return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_adopt_ap_stop(token);
    if (err != ESP_OK) return err;
    esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    s_ap_partial_stop = false;
    s_ap_stage = "configuration-handoff";
    return ESP_OK;
}

static esp_err_t wifi_ap_cleanup(void)
{
    bool deauth_pending;
    (void)esp32_mquickjs_wifi_radio_ap_deauth_poll(&deauth_pending);
    if (deauth_pending) return ESP_ERR_INVALID_STATE;
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    if (esp32_mquickjs_wifi_wps_ap_helper_held()) return ESP_ERR_INVALID_STATE;
#endif
    esp_err_t err;
    if (esp32_mquickjs_wifi_configuration_pending())
        return esp32_mquickjs_wifi_cleanup_ap_configuration();
    if (esp32_mquickjs_wifi_ap_stop_pending() ||
        (s_ap_lease.acquired && s_ap_lifecycle.identity == 0U && s_ap_coordinator.identity == 0U)) {
        bool handled = false;
        err = esp32_mquickjs_wifi_stop_ap_shared(&handled);
        if (handled) return err;
    }
    if (s_ap_coordinator.identity != 0U || s_ap_raw_owner.identity != 0U) return ESP_ERR_INVALID_STATE;
    s_ap_cleanup_pending = true;
    if (s_ap_detach_error != ESP_OK) return s_ap_detach_error;
    if (s_ap_lease.acquired && s_ap_lifecycle.identity == 0U) {
        s_ap_stage = "admission";
        err = esp32_mquickjs_wifi_radio_begin_lifecycle(NULL, NULL, &s_ap_lease, &s_ap_lifecycle);
        if (err != ESP_OK) return err;
    }
    if (s_ap_lease.acquired && s_ap_lifecycle.identity != 0U)
        esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    if (s_ap_lifecycle.identity != 0U) {
        s_ap_stage = "stop";
        err = esp32_mquickjs_wifi_radio_quiesce_lifecycle(&s_ap_lifecycle);
        if (err != ESP_OK) return err;
    }
    err = wifi_ap_retire_netif();
    if (err != ESP_OK) return err;
    if (s_ap_lifecycle.identity != 0U) {
        s_ap_stage = "shutdown";
        err = esp32_mquickjs_wifi_radio_finish_lifecycle(&s_ap_lifecycle, true);
        if (err != ESP_OK) return err;
    }
    s_ap_cleanup_pending = false;
    s_ap_stage = NULL;
    return ESP_OK;
}

bool esp32_mquickjs_wifi_parse_ap_config_for_operation(JSContext *ctx, JSValue options,
    wifi_config_t *config, const char *operation)
{
    static const char *const keys[] = {"ssid", "password", "channel", "hidden", "authMode", "maxConnections",
        "beaconIntervalMs", "dtimPeriod", "csaCount", "pairwiseCipher", "pmf", "ftmResponder", "saePwe",
        "gtkRekeyIntervalSeconds", "transitionDisable", "saeExt", "wpa3CompatibleMode",
        "bssMaxIdlePeriod", "bssMaxIdleProtectedKeepAlive"};
    static const char *const auth_modes[] = {"open", "wpa", "wpa2", "wpa/wpa2", "wpa3", "wpa2/wpa3", "owe"};
    static const wifi_auth_mode_t auth_values[] = {WIFI_AUTH_OPEN, WIFI_AUTH_WPA_PSK, WIFI_AUTH_WPA2_PSK,
        WIFI_AUTH_WPA_WPA2_PSK, WIFI_AUTH_WPA3_PSK, WIFI_AUTH_WPA2_WPA3_PSK, WIFI_AUTH_OWE};
    static const char *const cipher_names[] = {"tkip", "ccmp", "tkip/ccmp", "gcmp", "gcmp-256"};
    static const wifi_cipher_type_t cipher_values[] = {WIFI_CIPHER_TYPE_TKIP, WIFI_CIPHER_TYPE_CCMP,
        WIFI_CIPHER_TYPE_TKIP_CCMP, WIFI_CIPHER_TYPE_GCMP, WIFI_CIPHER_TYPE_GCMP256};
    static const char *const pmf_names[] = {"optional", "required", "disabled"};
    static const char *const pwe_names[] = {"hunting-and-pecking", "hash-to-element", "both"};
    static const wifi_sae_pwe_method_t pwe_values[] = {WPA3_SAE_PWE_HUNT_AND_PECK, WPA3_SAE_PWE_HASH_TO_ELEMENT, WPA3_SAE_PWE_BOTH};
    JSGCRef options_ref, property_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    JSCStringBuf buffer;
    bool ok = false, auth_explicit = false;
    size_t length, auth;
    uint32_t number;
    const char *text;
    *root = options;
    memset(config, 0, sizeof(*config));
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.startAP", keys, sizeof(keys)/sizeof(*keys))) goto done;
    *property = JS_GetPropertyStr(ctx, *root, "ssid");
    if (!JS_IsString(ctx, *property) ||
        (text = JS_ToCStringLen(ctx, &length, *property, &buffer)) == NULL ||
        length == 0 || length > 32 || memchr(text, 0, length) != NULL) goto invalid;
    memcpy(config->ap.ssid, text, length);
    config->ap.ssid_len = length;
    *property = JS_GetPropertyStr(ctx, *root, "password");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsString(ctx, *property) ||
            (text = JS_ToCStringLen(ctx, &length, *property, &buffer)) == NULL ||
            length < 1 || length > 63 || memchr(text, 0, length) != NULL) goto invalid;
        memcpy(config->ap.password, text, length);
    }
    config->ap.authmode = config->ap.password[0] ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;
    *property = JS_GetPropertyStr(ctx, *root, "authMode");
    if (JS_IsException(*property)) goto done;
    auth_explicit = !JS_IsUndefined(*property);
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *property, auth_modes, sizeof(auth_modes) / sizeof(auth_modes[0]), &auth)) goto invalid;
        config->ap.authmode = auth_values[auth];
    }
    *property = JS_GetPropertyStr(ctx, *root, "saeExt");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) goto invalid;
        config->ap.sae_ext = *property == JS_TRUE;
    }
    if (config->ap.sae_ext && !auth_explicit) config->ap.authmode = WIFI_AUTH_WPA3_PSK;
    *property = JS_GetPropertyStr(ctx, *root, "wpa3CompatibleMode");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) goto invalid;
        config->ap.wpa3_compatible_mode = *property == JS_TRUE;
    }
    config->ap.channel = 1;
    *property = JS_GetPropertyStr(ctx, *root, "channel");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *property, 1, 11, &number)) goto invalid;
        config->ap.channel = number;
    }
    *property = JS_GetPropertyStr(ctx, *root, "hidden");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) goto invalid;
        config->ap.ssid_hidden = *property == JS_TRUE;
    }
    config->ap.max_connection = ESP32_MQUICKJS_WIFI_MAX_AP_CLIENTS;
    *property = JS_GetPropertyStr(ctx, *root, "maxConnections");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *property, 1, ESP32_MQUICKJS_WIFI_MAX_AP_CLIENTS, &number)) goto invalid;
        config->ap.max_connection = number;
    }
    config->ap.beacon_interval = ESP32_MQUICKJS_WIFI_AP_BEACON_QUANTUM_TU; /* SDK TU, not milliseconds. */
    config->ap.dtim_period = 1;
    config->ap.csa_count = 3;
    *property = JS_GetPropertyStr(ctx, *root, "beaconIntervalMs");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        double ms;
        if (!JS_IsNumber(ctx, *property) || JS_ToNumber(ctx, &ms, *property) != 0 || !isfinite(ms) || ms <= 0 || ms > ESP32_MQUICKJS_WIFI_AP_BEACON_MAX_TU * 1.024) goto invalid;
        /* Round upward to the next SDK-supported 100 TU quantum. */
        config->ap.beacon_interval = (uint16_t)(ceil(ms / (ESP32_MQUICKJS_WIFI_AP_BEACON_QUANTUM_TU * 1.024)) * ESP32_MQUICKJS_WIFI_AP_BEACON_QUANTUM_TU);
    }
    *property = JS_GetPropertyStr(ctx, *root, "dtimPeriod");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *property, 1, ESP32_MQUICKJS_WIFI_AP_DTIM_MAX, &number)) goto invalid;
        config->ap.dtim_period = number;
    }
    *property = JS_GetPropertyStr(ctx, *root, "csaCount");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *property, 1, 255, &number)) goto invalid;
        config->ap.csa_count = number;
    }
    config->ap.pairwise_cipher = config->ap.authmode == WIFI_AUTH_WPA_PSK || config->ap.authmode == WIFI_AUTH_WPA_WPA2_PSK
        ? WIFI_CIPHER_TYPE_TKIP_CCMP : WIFI_CIPHER_TYPE_CCMP;
    if (config->ap.sae_ext) config->ap.pairwise_cipher = WIFI_CIPHER_TYPE_GCMP256;
    *property = JS_GetPropertyStr(ctx, *root, "pairwiseCipher");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (config->ap.authmode == WIFI_AUTH_OPEN || !esp32_mquickjs_value_to_enum(ctx, *property, cipher_names, 5, &auth)) goto invalid;
        config->ap.pairwise_cipher = cipher_values[auth];
    }
    config->ap.pmf_cfg.capable = true;
    config->ap.pmf_cfg.required = config->ap.authmode == WIFI_AUTH_WPA3_PSK || config->ap.authmode == WIFI_AUTH_OWE;
    *property = JS_GetPropertyStr(ctx, *root, "pmf");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if ((config->ap.authmode == WIFI_AUTH_OPEN || config->ap.authmode == WIFI_AUTH_WPA_PSK) || !esp32_mquickjs_value_to_enum(ctx, *property, pmf_names, 3, &auth)) goto invalid;
        config->ap.pmf_cfg.capable = auth != 2;
        config->ap.pmf_cfg.required = auth == 1;
    }
    *property = JS_GetPropertyStr(ctx, *root, "saePwe");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *property, pwe_names, 3, &auth)) goto invalid;
        config->ap.sae_pwe_h2e = pwe_values[auth];
    }
    if (config->ap.sae_ext && config->ap.sae_pwe_h2e == WPA3_SAE_PWE_UNSPECIFIED)
        config->ap.sae_pwe_h2e = WPA3_SAE_PWE_HASH_TO_ELEMENT;
    *property = JS_GetPropertyStr(ctx, *root, "ftmResponder");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) goto invalid;
        config->ap.ftm_responder = *property == JS_TRUE;
    }
    *property = JS_GetPropertyStr(ctx, *root, "transitionDisable");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) goto invalid;
        config->ap.transition_disable = *property == JS_TRUE;
    }
    *property = JS_GetPropertyStr(ctx, *root, "gtkRekeyIntervalSeconds");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *property, 0, UINT16_MAX, &number)) goto invalid;
        config->ap.gtk_rekey_interval = number;
    }
    *property = JS_GetPropertyStr(ctx, *root, "bssMaxIdlePeriod");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *property, 0, UINT16_MAX, &number)) goto invalid;
        config->ap.bss_max_idle_cfg.period = number;
    }
    *property = JS_GetPropertyStr(ctx, *root, "bssMaxIdleProtectedKeepAlive");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) goto invalid;
        config->ap.bss_max_idle_cfg.protected_keep_alive = *property == JS_TRUE;
    }
    esp_err_t validation = esp32_mquickjs_wifi_radio_validate_ap_config(config);
    if (validation == ESP_ERR_NOT_SUPPORTED) {
        if (strcmp(operation, "wifi.configure") == 0)
            (void)esp32_mquickjs_wifi_throw_configuration_error(ctx, validation, NULL, NULL);
        else
            (void)esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_AP_UNSUPPORTED", operation, validation, -1, UINT32_MAX);
        goto done;
    }
    if (validation != ESP_OK) goto invalid;
    ok = true;
    goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid or conflicting wifi.startAP options");
done:
    esp32_mquickjs_wireless_secure_zero(&buffer, sizeof(buffer));
    if (!ok) esp32_mquickjs_wireless_secure_zero(config, sizeof(*config));
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

bool esp32_mquickjs_wifi_parse_ap_config(JSContext *ctx, JSValue options,
    wifi_config_t *config, bool *allow_disconnect)
{
    return esp32_mquickjs_wifi_parse_start_ap_config(ctx, options, config, allow_disconnect);
}

static JSValue wifi_ap_error(JSContext *ctx, const char *operation, esp_err_t err)
{
    esp32_mquickjs_wifi_radio_status_t radio = {0};
    (void)esp32_mquickjs_wifi_radio_get_status(&radio);
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", s_ap_stage ? JS_NewString(ctx, s_ap_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "restartRequired", JS_NewBool(s_ap_detach_error != ESP_OK || radio.restart_required))) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    JSValue result = esp32_mquickjs_throw_native_error(ctx, "WIFI_AP_FAILED", operation, "Wi-Fi AP operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

static const char *wifi_ap_auth_name(wifi_auth_mode_t mode)
{
    switch (mode) {
    case WIFI_AUTH_OPEN: return "open";
    case WIFI_AUTH_WPA_PSK: return "wpa";
    case WIFI_AUTH_WPA2_PSK: return "wpa2";
    case WIFI_AUTH_WPA_WPA2_PSK: return "wpa/wpa2";
    case WIFI_AUTH_WPA3_PSK: return "wpa3";
    case WIFI_AUTH_WPA2_WPA3_PSK: return "wpa2/wpa3";
    case WIFI_AUTH_OWE: return "owe";
    default: return "unknown";
    }
}

/* JS_NewStringLen requires valid WTF-8. Binary SDK SSIDs need validation;
 * retain exact bytes separately instead of passing malformed text to the VM. */
JSValue esp32_mquickjs_wifi_ap_status(JSContext *ctx)
{
    /* Runtime-task local resources cannot retire while this synchronous query
     * constructs JS. Pending cleanup remains observable without SDK reads. */
    if (s_ap_netif == NULL && !s_ap_lease.acquired && !s_ap_cleanup_pending) return JS_NULL;
    esp32_mquickjs_wifi_ap_snapshot_t snapshot;
    const char *query_stage = NULL;
    const esp32_mquickjs_wifi_radio_lease_t raw_observer = {
        .generation = s_ap_raw_owner.generation, .identity = s_ap_raw_owner.identity,
        .client = ESP32_MQUICKJS_WIFI_RADIO_CLIENT_RAW_TX, .acquired = s_ap_raw_owner.identity != 0U};
    esp_err_t err = esp32_mquickjs_wifi_radio_sample_ap(
        s_ap_cleanup_pending ? NULL : s_ap_raw_owner.identity != 0U ? &raw_observer : &s_ap_lease,
        &snapshot, &query_stage);
    bool available = err == ESP_OK;
    char mac[18];
    if (available) snprintf(mac, sizeof(mac), MACSTR, MAC2STR(snapshot.mac));
    JSGCRef result_ref, bytes_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *bytes = JS_PushGCRef(ctx, &bytes_ref);
    *result = JS_NewObject(ctx);
    *bytes = JS_NULL;
    if (JS_IsException(*result)) goto fail;
    if (available) {
        *bytes = JS_NewArray(ctx, 0);
        if (JS_IsException(*bytes)) goto fail;
        for (uint32_t i = 0; i < snapshot.ssid_len; ++i) {
            if (JS_IsException(JS_SetPropertyUint32(ctx, *bytes, i,
                    JS_NewUint32(ctx, snapshot.ssid[i])))) goto fail;
        }
    }
    if (!esp32_mquickjs_set_property_ref(ctx, result, "started", JS_NewBool(snapshot.started)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "cleanupPending", JS_NewBool(s_ap_cleanup_pending)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "cleanupStage",
            s_ap_cleanup_pending && s_ap_stage != NULL ? JS_NewString(ctx, s_ap_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "queryError", available ? JS_NULL : JS_NewInt32(ctx, err)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "queryStage",
            query_stage != NULL ? JS_NewString(ctx, query_stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ssid",
            available ? esp32_mquickjs_wifi_ssid_text(ctx, snapshot.ssid, snapshot.ssid_len) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ssidBytes", *bytes) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "hidden", available ? JS_NewBool(snapshot.hidden) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channel", available ? JS_NewUint32(ctx, snapshot.channel) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "authMode", available ? JS_NewString(ctx, wifi_ap_auth_name(snapshot.authmode)) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "maxConnections", available ? JS_NewUint32(ctx, snapshot.max_connections) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "clientCount", available ? JS_NewUint32(ctx, snapshot.client_count) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "mac", available ? JS_NewString(ctx, mac) : JS_NULL)) goto fail;
    JS_PopGCRef(ctx, &bytes_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &bytes_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static const char *wifi_ap_cipher_name(wifi_cipher_type_t cipher)
{
    switch (cipher) {
    case WIFI_CIPHER_TYPE_TKIP: return "tkip";
    case WIFI_CIPHER_TYPE_CCMP: return "ccmp";
    case WIFI_CIPHER_TYPE_TKIP_CCMP: return "tkip/ccmp";
    case WIFI_CIPHER_TYPE_GCMP: return "gcmp";
    case WIFI_CIPHER_TYPE_GCMP256: return "gcmp-256";
    default: return "unknown";
    }
}

static const char *wifi_ap_pwe_name(wifi_sae_pwe_method_t pwe)
{
    switch (pwe) {
    case WPA3_SAE_PWE_HUNT_AND_PECK: return "hunting-and-pecking";
    case WPA3_SAE_PWE_HASH_TO_ELEMENT: return "hash-to-element";
    case WPA3_SAE_PWE_BOTH: return "both";
    default: return NULL;
    }
}

static JSValue wifi_ap_result(JSContext *ctx, const wifi_config_t *config)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    bool sae = config->ap.authmode == WIFI_AUTH_WPA3_PSK || config->ap.authmode == WIFI_AUTH_WPA2_WPA3_PSK ||
        config->ap.wpa3_compatible_mode;
    const char *pwe = sae ? wifi_ap_pwe_name(config->ap.sae_pwe_h2e) : NULL;
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "started", JS_NewBool(true)) ||
        !esp32_mquickjs_wifi_set_ssid_properties(ctx, result, config->ap.ssid, config->ap.ssid_len) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "channel", JS_NewUint32(ctx, config->ap.channel)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "hidden", JS_NewBool(config->ap.ssid_hidden)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "authMode", JS_NewString(ctx, wifi_ap_auth_name(config->ap.authmode))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "maxConnections", JS_NewUint32(ctx, config->ap.max_connection)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "beaconIntervalMs", JS_NewFloat64(ctx, config->ap.beacon_interval * 1.024)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "dtimPeriod", JS_NewUint32(ctx, config->ap.dtim_period)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "csaCount", JS_NewUint32(ctx, config->ap.csa_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "pairwiseCipher", config->ap.authmode == WIFI_AUTH_OPEN ? JS_NULL : JS_NewString(ctx, wifi_ap_cipher_name(config->ap.pairwise_cipher))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "pmf", config->ap.authmode == WIFI_AUTH_OPEN || config->ap.authmode == WIFI_AUTH_WPA_PSK ? JS_NULL : JS_NewString(ctx, config->ap.pmf_cfg.required ? "required" : config->ap.pmf_cfg.capable ? "optional" : "disabled")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "saePwe", pwe == NULL ? JS_NULL : JS_NewString(ctx, pwe)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ftmResponder", JS_NewBool(config->ap.ftm_responder)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "transitionDisable", JS_NewBool(config->ap.transition_disable)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "saeExt", JS_NewBool(config->ap.sae_ext)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "wpa3CompatibleMode", JS_NewBool(config->ap.wpa3_compatible_mode)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "bssMaxIdlePeriod", JS_NewUint32(ctx, config->ap.bss_max_idle_cfg.period)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "bssMaxIdleProtectedKeepAlive", JS_NewBool(config->ap.bss_max_idle_cfg.protected_keep_alive)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "gtkRekeyIntervalSeconds", JS_NewUint32(ctx, config->ap.gtk_rekey_interval))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_wifi_start_ap(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    wifi_config_t config = {0};
    bool allow_disconnect = false;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.startAP(options) expects one argument");
    if (!esp32_mquickjs_wifi_parse_ap_config(ctx, argv[0], &config, &allow_disconnect)) return JS_EXCEPTION;
    JSValue result;
    bool preparing = false;
    esp_err_t err = ESP_ERR_INVALID_STATE;
    if (allow_disconnect) {
        s_ap_stage = "ap-configuration-admission";
        err = esp32_mquickjs_wifi_activate_ap(&config);
        if (err != ESP_OK) {
            const char *stage = esp32_mquickjs_wifi_state()->cleanup_stage;
            if (stage != NULL) s_ap_stage = stage;
            goto fail;
        }
        s_ap_stage = NULL;
        result = wifi_ap_result(ctx, &config);
        goto done;
    }
    if (s_ap_netif != NULL || s_ap_cleanup_pending || s_ap_lease.acquired) {
        s_ap_stage = "admission";
        goto fail;
    }
    bool shared = false;
    s_ap_stage = "ap-reopen-admission";
    err = esp32_mquickjs_wifi_reopen_ap_shared(&config, &shared);
    if (shared) {
        if (err != ESP_OK) goto fail;
        result = wifi_ap_result(ctx, &config);
        goto done;
    }
    s_ap_stage = "admission";
    err = esp32_mquickjs_wifi_radio_reserve_ap(&s_ap_lease);
    if (err != ESP_OK) goto fail;
    preparing = true;
    s_ap_stage = "configuration";
    err = esp32_mquickjs_wifi_configure_interfaces(WIFI_MODE_AP, WIFI_STORAGE_RAM,
        true, NULL, NULL, &config, esp32_mquickjs_wifi_radio_accept_ap_config, NULL, NULL, false);
    if (esp32_mquickjs_wifi_configuration_pending()) preparing = false;
    if (err != ESP_OK) {
        const char *stage = esp32_mquickjs_wifi_state()->cleanup_stage;
        if (stage != NULL) s_ap_stage = stage;
        goto fail;
    }
    preparing = false;
    s_ap_stage = NULL;
    result = wifi_ap_result(ctx, &config);
    goto done;
fail:
    if (preparing) {
        const char *stage = s_ap_stage;
        esp_err_t cleanup_error = wifi_ap_cleanup();
        if (cleanup_error != ESP_OK) err = cleanup_error;
        else s_ap_stage = stage;
    }
    result = wifi_ap_error(ctx, "wifi.startAP", err);
done:
    esp32_mquickjs_wireless_secure_zero(&config, sizeof(config));
    return result;
}

