99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_ap.c
JSValue js_wifi_stop_ap(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.stopAP(timeoutMs?) expects at most one argument");
    uint32_t timeout_ms;
    if (!esp32_mquickjs_wifi_capture_stop_ap_timeout(ctx, argc ? argv[0] : JS_UNDEFINED, &timeout_ms)) return JS_EXCEPTION;
    esp_err_t err = esp32_mquickjs_wifi_wait_begin(timeout_ms);
    if (err == ESP_OK) {
        err = wifi_ap_cleanup();
        esp32_mquickjs_wifi_wait_end();
    }
    if (err != ESP_OK) return wifi_ap_error(ctx, "wifi.stopAP", err);
    return esp32_mquickjs_wifi_make_status_object(ctx);
}

static JSValue wifi_ap_client_result(JSContext *ctx, const wifi_sta_info_t *station, uint16_t aid)
{
    static const char *const names[] = {"11b", "11g", "11n", "11a", "11ac", "11ax", "lr"};
    const bool flags[] = {station->phy_11b, station->phy_11g, station->phy_11n,
                         station->phy_11a, station->phy_11ac, station->phy_11ax, station->phy_lr};
    JSGCRef result_ref, phy_ref, value_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *phy = JS_PushGCRef(ctx, &phy_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    char address[18];
    snprintf(address, sizeof(address), MACSTR, MAC2STR(station->mac));
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "address", JS_NewString(ctx, address)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "aid", aid ? JS_NewUint32(ctx, aid) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "rssi", JS_NewInt32(ctx, station->rssi))) goto fail;
    *phy = JS_NewArray(ctx, 0);
    if (JS_IsException(*phy)) goto fail;
    uint32_t count = 0;
    for (size_t i = 0; i < sizeof(flags) / sizeof(*flags); ++i) {
        if (!flags[i]) continue;
        *value = JS_NewString(ctx, names[i]);
        if (JS_IsException(*value) || JS_IsException(JS_SetPropertyUint32(ctx, *phy, count++, *value))) goto fail;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, result, "phy", *phy)) goto fail;
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &phy_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &phy_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static bool wifi_ap_capture_clients_options(JSContext *ctx, JSValue options, bool *include_ip)
{
    static const char *const keys[] = {"includeIp"};
    *include_ip = false;
    if (JS_IsUndefined(options)) return true;
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = options;
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.apClients", keys, 1)) goto done;
    *value = JS_GetPropertyStr(ctx, *root, "includeIp");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!JS_IsBool(*value)) {
            JS_ThrowTypeError(ctx, "wifi.apClients includeIp must be boolean");
            goto done;
        }
        *include_ip = *value == JS_TRUE;
    }
    ok = true;
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

/* Runtime task owns the AP netif. SDK copies DHCP observations on the lwIP
 * task; no JS/poller runs between the association snapshot and this lookup.
 * Missing MACs leave outputs unchanged, so zero every IP before querying. */
static esp_err_t wifi_ap_client_ips(const esp32_mquickjs_wifi_ap_clients_t *snapshot,
                                    esp_netif_pair_mac_ip_t *pairs)
{
    if (s_ap_cleanup_pending || s_ap_netif == NULL || snapshot == NULL || pairs == NULL ||
        snapshot->stations.num < 0 || snapshot->stations.num > ESP32_MQUICKJS_WIFI_MAX_AP_CLIENTS)
        return ESP_ERR_INVALID_STATE;
    memset(pairs, 0, sizeof(*pairs) * ESP32_MQUICKJS_WIFI_MAX_AP_CLIENTS);
    if (snapshot->stations.num == 0) return ESP_OK;
    for (int i = 0; i < snapshot->stations.num; ++i)
        memcpy(pairs[i].mac, snapshot->stations.sta[i].mac, sizeof(pairs[i].mac));
    return esp_netif_dhcps_get_clients_by_mac(s_ap_netif, snapshot->stations.num, pairs);
}

JSValue js_wifi_deauth_client(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc != 1 || !JS_IsString(ctx, argv[0]))
        return JS_ThrowTypeError(ctx, "wifi.deauthClient(address) expects one MAC string");
    JSCStringBuf buffer;
    size_t length;
    const char *text = JS_ToCStringLen(ctx, &length, argv[0], &buffer);
    if (!text) return JS_EXCEPTION;
    uint8_t address[6];
    if (length != 17 || !esp32_mquickjs_wireless_parse_address(text, address) ||
        (address[0] & 1U) || !memcmp(address, "\0\0\0\0\0\0", 6))
        return JS_ThrowTypeError(ctx, "wifi.deauthClient expects a nonzero unicast MAC in xx:xx:xx:xx:xx:xx form");
    bool requested = false, unknown = false;
    const char *stage = s_ap_cleanup_pending ? s_ap_stage : "deauth-admission";
    esp_err_t error = s_ap_cleanup_pending ? ESP_ERR_INVALID_STATE :
        esp32_mquickjs_wifi_radio_ap_deauth(&s_ap_lease, address, &requested, &unknown, &stage);
    if (error == ESP_OK) return JS_NewBool(requested);
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, error)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "stage", stage ? JS_NewString(ctx, stage) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "requestAccepted", unknown ? JS_NULL : JS_NewBool(requested)) ||
        !esp32_mquickjs_set_property_ref(ctx, details, "handoffUnknown", JS_NewBool(unknown))) goto fail;
    (void)esp32_mquickjs_throw_native_error(ctx, "WIFI_AP_FAILED", "wifi.deauthClient",
        "AP client deauthentication request failed", *details);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_ap_clients(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.apClients(options?) expects at most one argument");
    bool include_ip;
    if (!wifi_ap_capture_clients_options(ctx, argc ? argv[0] : JS_UNDEFINED, &include_ip)) return JS_EXCEPTION;
#if !CONFIG_LWIP_DHCPS
    if (include_ip) {
        if (!s_ap_cleanup_pending) s_ap_stage = "clients-ip";
        return wifi_ap_error(ctx, "wifi.apClients", ESP_ERR_NOT_SUPPORTED);
    }
#endif
    esp32_mquickjs_wifi_ap_clients_t snapshot;
    esp_netif_pair_mac_ip_t pairs[ESP32_MQUICKJS_WIFI_MAX_AP_CLIENTS];
    esp_err_t err = s_ap_cleanup_pending ? ESP_ERR_INVALID_STATE :
        esp32_mquickjs_wifi_radio_ap_clients(&s_ap_lease, &snapshot);
    const char *stage = "clients";
    if (err == ESP_OK && include_ip) {
        stage = "clients-ip";
        err = wifi_ap_client_ips(&snapshot, pairs);
    }
    if (err != ESP_OK) {
        /* Do not overwrite the cleanup stage retained by a failed stopAP. */
        if (!s_ap_cleanup_pending) s_ap_stage = stage;
        return wifi_ap_error(ctx, "wifi.apClients", err);
    }
    JSGCRef result_ref, entry_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *entry = JS_PushGCRef(ctx, &entry_ref);
    *result = JS_NewArray(ctx, 0);
    if (JS_IsException(*result)) goto fail;
    for (int i = 0; i < snapshot.stations.num; ++i) {
        *entry = wifi_ap_client_result(ctx, &snapshot.stations.sta[i], snapshot.aid[i]);
        if (JS_IsException(*entry)) goto fail;
        if (include_ip) {
            char address[16];
            JSValue ip = JS_NULL;
            if (pairs[i].ip.addr != 0) {
                if (esp_ip4addr_ntoa(&pairs[i].ip, address, sizeof(address)) == NULL) {
                    JS_ThrowInternalError(ctx, "failed to format AP client IPv4 address");
                    goto fail;
                }
                ip = JS_NewString(ctx, address);
            }
            if (!esp32_mquickjs_set_property_ref(ctx, entry, "ip", ip)) goto fail;
        }
        if (JS_IsException(JS_SetPropertyUint32(ctx, *result, i, *entry))) goto fail;
    }
    JS_PopGCRef(ctx, &entry_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

esp_err_t esp32_mquickjs_wifi_ap_begin_recovery(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_recovery_request_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    if (s_ap_raw_owner.identity != 0U && (operation == NULL ||
        operation->kind != ESP32_MQUICKJS_WIFI_RECOVERY_RAW_TX ||
        operation->generation != s_ap_raw_owner.generation)) return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_recovery(
        application, station, &s_ap_lease, operation, token, mode);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_stage = "recovery-handoff";
    esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    return ESP_OK;
}

