99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_ap.c
esp_err_t esp32_mquickjs_wifi_ap_begin_stopped_restart(
    esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_radio_restart_selection_t *selection)
{
    if (s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_lease.acquired || s_ap_cleanup_pending || s_ap_detach_error != ESP_OK)
        return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_stopped_restart(token, selection);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_stage = "configuration-handoff";
    return ESP_OK;
}

#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
esp_err_t esp32_mquickjs_wifi_ap_begin_enterprise_restart(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_eap_profile_t *profile, bool allow_ap_restart,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{
    if (s_ap_raw_owner.identity || s_ap_lifecycle.identity || s_ap_coordinator.identity ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    esp_err_t error = esp32_mquickjs_wifi_radio_eap_begin_restart(identity, application, station,
        &s_ap_lease, profile, allow_ap_restart, token, mode);
    if (error == ESP_OK) {
        s_ap_coordinator = *token;
        s_ap_cleanup_pending = true;
        s_ap_stage = "configuration-handoff";
    }
    return error;
}

esp_err_t esp32_mquickjs_wifi_ap_begin_enterprise_stop(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_eap_begin_stop(identity,
        application, station, &s_ap_lease, token);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_stage = "configuration-handoff";
    /* SDK still pins this lease; release only after exact EAP retirement. */
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_ap_release_enterprise_stop(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (!token || !token->identity || token->identity != s_ap_coordinator.identity ||
        token->generation != s_ap_coordinator.generation) return ESP_ERR_INVALID_STATE;
    esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    return s_ap_lease.acquired ? ESP_ERR_INVALID_STATE : ESP_OK;
}

#endif

esp_err_t esp32_mquickjs_wifi_ap_begin_configuration(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_lifecycle(
        application, station, &s_ap_lease, token);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_stage = "configuration-handoff";
    esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_ap_begin_start_configuration(
    esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, bool *already_started)
{
    if (s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_start_lifecycle(
        application, station, &s_ap_lease, selection, token, already_started);
    if (err != ESP_OK || *already_started) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_stage = "configuration-handoff";
    esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_ap_begin_selected_configuration(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    const esp32_mquickjs_wifi_radio_start_controls_t *start_controls,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    esp_err_t err = esp32_mquickjs_wifi_radio_begin_configuration_lifecycle(
        application, station, &s_ap_lease, selection, controls, start_controls, token);
    if (err != ESP_OK) return err;
    s_ap_coordinator = *token;
    s_ap_cleanup_pending = true;
    s_ap_stage = "configuration-handoff";
    esp32_mquickjs_wifi_radio_release(&s_ap_lease);
    return ESP_OK;
}

esp_err_t esp32_mquickjs_wifi_ap_prepare_for_configuration(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp_err_t err = esp32_mquickjs_wifi_radio_check_stopped_lifecycle(token, false);
    if (err != ESP_OK) return err;
    if (s_ap_raw_owner.identity != 0U || s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_lease.acquired || s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return ESP_ERR_INVALID_STATE;
    if (s_ap_netif != NULL) return ESP_OK;
    s_ap_cleanup_pending = true;
    err = wifi_ap_prepare_netif();
    if (err == ESP_OK) { s_ap_cleanup_pending = false; s_ap_stage = NULL; }
    return err;
}

static esp_err_t wifi_ap_retire_for_token(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (s_ap_lifecycle.identity != 0U || s_ap_lease.acquired ||
        (s_ap_coordinator.identity != 0U &&
         (s_ap_coordinator.identity != token->identity ||
          s_ap_coordinator.generation != token->generation))) return ESP_ERR_INVALID_STATE;
    s_ap_cleanup_pending = true;
    esp_err_t err = wifi_ap_retire_netif();
    if (err == ESP_OK) {
        memset(&s_ap_raw_owner, 0, sizeof(s_ap_raw_owner));
        memset(&s_ap_coordinator, 0, sizeof(s_ap_coordinator));
        s_ap_cleanup_pending = false;
        s_ap_stage = NULL;
    }
    return err;
}

