99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_ap.c
esp_err_t esp32_mquickjs_wifi_ap_retire_for_configuration(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp_err_t err = esp32_mquickjs_wifi_radio_check_stopped_lifecycle(token, true);
    return err == ESP_OK ? wifi_ap_retire_for_token(token) : err;
}

esp_err_t esp32_mquickjs_wifi_ap_retire_for_recovery(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    esp_err_t err = esp32_mquickjs_wifi_radio_check_stopped_recovery(token);
    return err == ESP_OK ? wifi_ap_retire_for_token(token) : err;
}

esp32_mquickjs_wifi_radio_lease_t *esp32_mquickjs_wifi_ap_configuration_slot(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{
    if (esp32_mquickjs_wifi_radio_check_stopped_lifecycle(token, false) != ESP_OK ||
        s_ap_lifecycle.identity != 0U || s_ap_coordinator.identity != 0U ||
        s_ap_lease.acquired || s_ap_netif == NULL ||
        s_ap_cleanup_pending || s_ap_detach_error != ESP_OK) return NULL;
    return &s_ap_lease;
}

bool esp32_mquickjs_init_wifi_ap_runtime(JSContext *ctx)
{
    if (!s_ap_cleanup_pending) return true;
    esp_err_t err = wifi_ap_cleanup();
    if (err == ESP_OK) return true;
    (void)wifi_ap_error(ctx, "wifi.stopAP", err);
    return false;
}

void esp32_mquickjs_deinit_wifi_ap_runtime(void)
{
    (void)wifi_ap_cleanup();
}
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
esp_err_t esp32_mquickjs_wifi_ap_open_raw_tx_rate(
    esp32_mquickjs_wifi_raw_tx_ap_context_t *context, const wifi_tx_rate_config_t *rate,
    uint8_t channel, esp32_mquickjs_wifi_radio_lease_t *lease, uint8_t *actual_channel, const char **stage)
{ (void)context; (void)rate; (void)channel; (void)lease; (void)actual_channel; if (stage) *stage = "ap-rate-disabled"; return ESP_ERR_NOT_SUPPORTED; }
esp_err_t esp32_mquickjs_wifi_ap_close_raw_tx_rate(
    esp32_mquickjs_wifi_raw_tx_ap_context_t *context, esp32_mquickjs_wifi_radio_lease_t *lease,
    bool physically_terminated, const char **stage)
{ (void)context; (void)lease; (void)physically_terminated; if (stage) *stage = "ap-rate-disabled"; return ESP_ERR_NOT_SUPPORTED; }
JSValue esp32_mquickjs_wifi_ap_status(JSContext *ctx) { (void)ctx; return JS_NULL; }
esp_err_t esp32_mquickjs_wifi_ap_begin_start_configuration(
    esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, bool *already_started)
{ return esp32_mquickjs_wifi_radio_begin_start_lifecycle(application, station, NULL, selection, token, already_started); }

esp_err_t esp32_mquickjs_wifi_ap_reopen(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station, wifi_config_t *config,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)application; (void)station; (void)config; (void)token; return ESP_ERR_NOT_SUPPORTED; }

esp_err_t esp32_mquickjs_wifi_ap_begin_partial_stop(
    const esp32_mquickjs_wifi_radio_lease_t *application, const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)application; (void)station; (void)token; return ESP_ERR_NOT_SUPPORTED; }
esp_err_t esp32_mquickjs_wifi_ap_retire_partial_stop(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)token; return ESP_ERR_NOT_SUPPORTED; }
esp_err_t esp32_mquickjs_wifi_ap_finish_partial_stop(esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)token; return ESP_ERR_NOT_SUPPORTED; }
esp_err_t esp32_mquickjs_wifi_ap_adopt_partial_stop(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)token; return ESP_ERR_NOT_SUPPORTED; }
esp_err_t esp32_mquickjs_wifi_ap_netif_cleanup_error(void) { return ESP_OK; }
esp_err_t esp32_mquickjs_wifi_ap_begin_recovery(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    const esp32_mquickjs_wifi_recovery_request_t *operation,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{ return esp32_mquickjs_wifi_radio_begin_recovery(application, station, NULL, operation, token, mode); }
esp_err_t esp32_mquickjs_wifi_ap_begin_stopped_restart(
    esp32_mquickjs_wifi_radio_lifecycle_t *token,
    esp32_mquickjs_wifi_radio_restart_selection_t *selection)
{ return esp32_mquickjs_wifi_radio_begin_stopped_restart(token, selection); }
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
esp_err_t esp32_mquickjs_wifi_ap_begin_enterprise_stop(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ return esp32_mquickjs_wifi_radio_eap_begin_stop(identity, application, station, NULL, token); }
esp_err_t esp32_mquickjs_wifi_ap_begin_enterprise_restart(uint64_t identity,
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_eap_profile_t *profile, bool allow_ap_restart,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, wifi_mode_t *mode)
{ return esp32_mquickjs_wifi_radio_eap_begin_restart(identity, application, station, NULL, profile, allow_ap_restart, token, mode); }
esp_err_t esp32_mquickjs_wifi_ap_release_enterprise_stop(
    const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)token; return ESP_OK; }

#endif
esp_err_t esp32_mquickjs_wifi_ap_begin_configuration(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ return esp32_mquickjs_wifi_radio_begin_lifecycle(application, station, NULL, token); }
esp_err_t esp32_mquickjs_wifi_ap_begin_selected_configuration(
    const esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    const esp32_mquickjs_wifi_radio_config_controls_t *controls,
    const esp32_mquickjs_wifi_radio_start_controls_t *start_controls,
    esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ return esp32_mquickjs_wifi_radio_begin_configuration_lifecycle(
    application, station, NULL, selection, controls, start_controls, token); }
esp_err_t esp32_mquickjs_wifi_ap_prepare_for_configuration(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)token; return ESP_ERR_NOT_SUPPORTED; }
esp_err_t esp32_mquickjs_wifi_ap_retire_for_configuration(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ return esp32_mquickjs_wifi_radio_check_stopped_lifecycle(token, true); }
esp_err_t esp32_mquickjs_wifi_ap_retire_for_recovery(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ return esp32_mquickjs_wifi_radio_check_stopped_recovery(token); }
esp32_mquickjs_wifi_radio_lease_t *esp32_mquickjs_wifi_ap_configuration_slot(const esp32_mquickjs_wifi_radio_lifecycle_t *token)
{ (void)token; return NULL; }

const esp32_mquickjs_wifi_radio_lease_t *esp32_mquickjs_wifi_ap_control_lease(void) { return NULL; }
JSValue js_wifi_deauth_client(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.deauthClient(address) expects one MAC string");
    return esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_AP_UNSUPPORTED", "wifi.deauthClient", ESP_ERR_NOT_SUPPORTED, 0, 0);
}
JSValue js_wifi_ap_clients(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.apClients(options?) expects at most one argument");
    return esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_AP_UNSUPPORTED", "wifi.apClients", ESP_ERR_NOT_SUPPORTED, 0, 0);
}
JSValue js_wifi_start_ap(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_AP_UNSUPPORTED", "wifi.startAP", ESP_ERR_NOT_SUPPORTED, 0, 0);
}
JSValue js_wifi_stop_ap(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    if (argc > 1) return JS_ThrowTypeError(ctx, "wifi.stopAP(timeoutMs?) expects at most one argument");
    uint32_t timeout_ms;
    if (!esp32_mquickjs_wifi_capture_stop_ap_timeout(ctx, argc ? argv[0] : JS_UNDEFINED, &timeout_ms)) return JS_EXCEPTION;
    return esp32_mquickjs_wifi_make_status_object(ctx);
}
bool esp32_mquickjs_init_wifi_ap_runtime(JSContext *ctx) { (void)ctx;return true; }
void esp32_mquickjs_deinit_wifi_ap_runtime(void) {}
#endif
